#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kMTliMmQzMi02ZmFjLTQxODUtYTY4Mi1jY2YyNjYxNWQ4Yzg7b2JqZWN0SWQ9YzdmOTkwMWItMzBiMC00MjljLTk0ZTktMzQxOTEwMTVjN2RiO3N1YnNjcmlwdGlvbklkPTViMTg1ZjM0LTc1ZWItNDI0NS04NjZiLWRhNmU2OTQwNDAyMTt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-ecommerce]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/virtualNetworks/vnet-ecommerce]
module.rc.azurerm_redis_cache.rc: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Cache/redis/redis-auto]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerService/managedClusters/aks-ecommerce]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/virtualNetworks/vnet-ecommerce/subnets/snet-ecommerce]
module.sa.azurerm_storage_management_policy.sa_policy: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage/managementPolicies/default]
module.ss.azurerm_storage_share.ss: Refreshing state... [id=https://mysonarqubestorage.file.core.windows.net/mysonarqubedata]
module.cg.azurerm_container_group.cg: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + custom_ca_trust_certificates_base64              = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = (sensitive value)
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "ecommerce-rg-auto"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerService/managedClusters/aks-ecommerce"
        name                                = "aks-ecommerce"
        tags                                = {
            "Environment" = "Prod"
            "Service"     = "Auto"
        }
        # (27 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "default"
            tags                         = {}
            # (22 unchanged attributes hidden)

          - upgrade_settings {
              - max_surge = "10%" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.mysql.azurerm_mysql_flexible_server.mysql will be created
  + resource "azurerm_mysql_flexible_server" "mysql" {
      + administrator_login           = "mysqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "example-mysqlserver"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "ecommerce-rg-auto"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + tags                          = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
      + version                       = "5.7"

      + high_availability {
          + mode = "ZoneRedundant"
        }
    }

  # module.mysql_snet.azurerm_subnet.mysql_snet will be created
  + resource "azurerm_subnet" "mysql_snet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "mysqlsnet-ecommerce"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ecommerce-rg-auto"
      + virtual_network_name                           = "vnet-ecommerce"

      + delegation {
          + name = "mysqlDelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

  # module.ni.azurerm_network_interface.ni will be created
  + resource "azurerm_network_interface" "ni" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ni-ecommerce"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ecommerce-rg-auto"
      + tags                          = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "Internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/virtualNetworks/vnet-ecommerce/subnets/snet-ecommerce"
        }
    }

  # module.nisga.azurerm_network_interface_security_group_association.nisga will be created
  + resource "azurerm_network_interface_security_group_association" "nisga" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-ecommerce"
    }

  # module.snet.azurerm_subnet.snet will be updated in-place
  ~ resource "azurerm_subnet" "snet" {
        id                                             = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/virtualNetworks/vnet-ecommerce/subnets/snet-ecommerce"
        name                                           = "snet-ecommerce"
        # (10 unchanged attributes hidden)

      - delegation {
          - name = "mysqlDelegation" -> null

          - service_delegation {
              - actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                ] -> null
              - name    = "Microsoft.DBforMySQL/flexibleServers" -> null
            }
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @G20-00, Action: `pull_request`, Workflow: `On Pull Request`*